perf/scenarios/load_spaceflights.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      payload:
        path: "metars.csv"
        order: random
        skipHeader: true
        fields:
          - "Name"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  # Se aumenta progresivamente la carga sobre el sistema
  phases: 
    # Warm up
    - name: Ramp up (1 to 30)
      duration: 30
      arrivalRate: 1
      rampTo: 30
    - name: Ramp down (30 to 20)
      duration: 15
      arrivalRate: 30
      rampTo: 20
    - name: Ramp up (20 to 30)
      duration: 15
      arrivalRate: 20
      rampTo: 30
    # Load
    - name: Ramp up (30 to 60)
      duration: 30
      arrivalRate: 30
      rampTo: 60
    # Ya a partir de aca empieza haber problemas en las conexiones, el servidor no procesa suficientemente rapido
    - name: Plain (60)
      duration: 30
      arrivalRate: 60
    - name: Ramp up (60 to 120)
      duration: 30
      arrivalRate: 60
      rampTo: 20
    # Cool down
    - name: Cool down (20 to 10) in 60 seconds
      duration: 60
      arrivalRate: 20
      rampTo: 10
    - name: Cool down (10 to 1) in 60 seconds
      duration: 60
      arrivalRate: 10
      rampTo: 1

scenarios:
  - name: Spaceflights
    flow:
      - get:
          url: '/spaceflight_news'