perf/scenarios/load_spaceflights.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      payload:
        path: "metars.csv"
        order: random
        skipHeader: true
        fields:
          - "Name"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  # Se aumenta progresivamente la carga sobre el sistema
  phases: 
    # Warm up
    - name: Ramp up (1 to 30)
      duration: 30
      arrivalRate: 1
      rampTo: 30
    - name: Ramp down (30 to 20)
      duration: 15
      arrivalRate: 30
      rampTo: 20
    - name: Ramp up (20 to 30)
      duration: 15
      arrivalRate: 20
      rampTo: 30
    # Load
    - name: Ramp up (30 to 60)
      duration: 30
      arrivalRate: 30
      rampTo: 60
    - name: Plain (60)
      duration: 30
      arrivalRate: 60
    - name: Ramp up (60 to 120)
      duration: 30
      arrivalRate: 60
      rampTo: 120
    # - name: Plain (120)
    #   duration: 30
    #   arrivalRate: 120
    # - name: Ramp up (120 to 240)
    #   duration: 30
    #   arrivalRate: 120
    #   rampTo: 240
    # - name: Plain (240)
    #   duration: 30
    #   arrivalRate: 240
    # - name: Ramp up (240 to 280)
    #   duration: 15
    #   arrivalRate: 240
    #   rampTo: 280
    # Desde aca se esta cerca del fallo porque la API METARs empieza a bloquear las requests
    # - name: Plain (280)
    #   duration: 15
    #   arrivalRate: 280
    # Cool down
    # - name: Ramp down (280 to 20) in 60 seconds
    #   duration: 60
    #   arrivalRate: 280
    #   rampTo: 20
    - name: Plain (20 to 1) in 60 seconds
      duration: 60
      arrivalRate: 20
      rampTo: 1

scenarios:
  - name: Spaceflights
    flow:
      - get:
          url: '/spaceflight_news'